Revit 2022 API
PathOfTravel.IsInRevealObstaclesMode Method
 Returns current state of Reveal Obstacles mode for the given view.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2020.1
Syntax
C#
public static bool IsInRevealObstaclesMode(
	View DBView
)
Visual Basic
Public Shared Function IsInRevealObstaclesMode ( _
	DBView As View _
) As Boolean
Visual C++
public:
static bool IsInRevealObstaclesMode(
	View^ DBView
)
Parameters
DBView
Type: Autodesk.Revit.DB.View
 The view to determine current state of Reveal Obstacles mode for.
Return Value
 True if Reveal Obstacles mode is ON for the view, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  View is not in a family or a document in in-place edit mode. -or- View is not a floor plan view.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The document containing DBView is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The Path of Travel calculation service is not available
See Also
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace